{
    "generatedBy": "keras v2.4.0",
    "format": "layers-model",
    "convertedBy": "TensorFlow.js Converter v3.1.0",
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of9.bin",
                "group1-shard2of9.bin",
                "group1-shard3of9.bin",
                "group1-shard4of9.bin",
                "group1-shard5of9.bin",
                "group1-shard6of9.bin",
                "group1-shard7of9.bin",
                "group1-shard8of9.bin",
                "group1-shard9of9.bin"
            ],
            "weights": [
                {
                    "shape": [
                        3,
                        3,
                        3,
                        32
                    ],
                    "dtype": "float32",
                    "name": "conv2d/kernel"
                },
                {
                    "shape": [
                        32
                    ],
                    "dtype": "float32",
                    "name": "conv2d/bias"
                },
                {
                    "shape": [
                        3,
                        3,
                        32,
                        64
                    ],
                    "dtype": "float32",
                    "name": "conv2d_1/kernel"
                },
                {
                    "shape": [
                        64
                    ],
                    "dtype": "float32",
                    "name": "conv2d_1/bias"
                },
                {
                    "shape": [
                        3,
                        3,
                        64,
                        128
                    ],
                    "dtype": "float32",
                    "name": "conv2d_2/kernel"
                },
                {
                    "shape": [
                        128
                    ],
                    "dtype": "float32",
                    "name": "conv2d_2/bias"
                },
                {
                    "shape": [
                        36992,
                        250
                    ],
                    "dtype": "float32",
                    "name": "dense/kernel"
                },
                {
                    "shape": [
                        250
                    ],
                    "dtype": "float32",
                    "name": "dense/bias"
                },
                {
                    "shape": [
                        250,
                        7
                    ],
                    "dtype": "float32",
                    "name": "dense_1/kernel"
                },
                {
                    "shape": [
                        7
                    ],
                    "dtype": "float32",
                    "name": "dense_1/bias"
                }
            ]
        }
    ],
    "modelTopology": {
        "keras_version": "2.4.0",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "sparse": false,
                            "batch_input_shape": [
                                null,
                                150,
                                150,
                                3
                            ],
                            "dtype": "float32",
                            "ragged": false,
                            "name": "conv2d_input"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "dtype": "float32",
                            "trainable": true,
                            "strides": [
                                1,
                                1
                            ],
                            "bias_constraint": null,
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "name": "conv2d",
                            "batch_input_shape": [
                                null,
                                150,
                                150,
                                3
                            ],
                            "kernel_constraint": null,
                            "data_format": "channels_last",
                            "padding": "valid",
                            "groups": 1,
                            "activation": "relu",
                            "filters": 32,
                            "use_bias": true,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "data_format": "channels_last",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "dtype": "float32",
                            "strides": [
                                2,
                                2
                            ],
                            "trainable": true,
                            "name": "max_pooling2d"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "dtype": "float32",
                            "trainable": true,
                            "strides": [
                                1,
                                1
                            ],
                            "bias_constraint": null,
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "name": "conv2d_1",
                            "kernel_constraint": null,
                            "data_format": "channels_last",
                            "padding": "valid",
                            "groups": 1,
                            "activation": "relu",
                            "filters": 64,
                            "use_bias": true,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "data_format": "channels_last",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "dtype": "float32",
                            "strides": [
                                2,
                                2
                            ],
                            "trainable": true,
                            "name": "max_pooling2d_1"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "dtype": "float32",
                            "trainable": true,
                            "strides": [
                                1,
                                1
                            ],
                            "bias_constraint": null,
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "name": "conv2d_2",
                            "kernel_constraint": null,
                            "data_format": "channels_last",
                            "padding": "valid",
                            "groups": 1,
                            "activation": "relu",
                            "filters": 128,
                            "use_bias": true,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "data_format": "channels_last",
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "dtype": "float32",
                            "strides": [
                                2,
                                2
                            ],
                            "trainable": true,
                            "name": "max_pooling2d_2"
                        }
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "data_format": "channels_last",
                            "trainable": true,
                            "dtype": "float32",
                            "name": "flatten"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "units": 250,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "name": "dense",
                            "dtype": "float32",
                            "use_bias": true,
                            "activation": "relu",
                            "kernel_constraint": null,
                            "trainable": true,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "units": 7,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "bias_constraint": null,
                            "name": "dense_1",
                            "dtype": "float32",
                            "use_bias": true,
                            "activation": "softmax",
                            "kernel_constraint": null,
                            "trainable": true,
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null
                        }
                    }
                ],
                "name": "sequential"
            }
        },
        "backend": "tensorflow",
        "training_config": {
            "loss_weights": null,
            "loss": "categorical_crossentropy",
            "metrics": [
                "accuracy"
            ],
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "beta_2": 0.9990000128746033,
                    "beta_1": 0.8999999761581421,
                    "epsilon": 1e-07,
                    "amsgrad": false,
                    "decay": 0.0,
                    "learning_rate": 0.0010000000474974513,
                    "name": "Adam"
                }
            },
            "weighted_metrics": null
        }
    }
}