{"weightsManifest": [{"weights": [{"name": "conv2d_11/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_11/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_12/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_12/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_13/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_13/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_8/kernel", "shape": [36992, 250], "dtype": "float32"}, {"name": "dense_8/bias", "shape": [250], "dtype": "float32"}, {"name": "dense_9/kernel", "shape": [250, 11], "dtype": "float32"}, {"name": "dense_9/bias", "shape": [11], "dtype": "float32"}], "paths": ["group1-shard1of9.bin", "group1-shard2of9.bin", "group1-shard3of9.bin", "group1-shard4of9.bin", "group1-shard5of9.bin", "group1-shard6of9.bin", "group1-shard7of9.bin", "group1-shard8of9.bin", "group1-shard9of9.bin"]}], "generatedBy": "keras v2.4.0", "modelTopology": {"keras_version": "2.4.0", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_4", "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "ragged": false, "name": "conv2d_11_input", "batch_input_shape": [null, 150, 150, 3], "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "batch_input_shape": [null, 150, 150, 3], "dtype": "float32", "data_format": "channels_last", "use_bias": true, "strides": [1, 1], "padding": "valid", "groups": 1, "name": "conv2d_11", "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 32, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_11", "dtype": "float32", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "dtype": "float32", "data_format": "channels_last", "use_bias": true, "strides": [1, 1], "padding": "valid", "groups": 1, "name": "conv2d_12", "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 64, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_12", "dtype": "float32", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "kernel_size": [3, 3], "dilation_rate": [1, 1], "dtype": "float32", "data_format": "channels_last", "use_bias": true, "strides": [1, 1], "padding": "valid", "groups": 1, "name": "conv2d_13", "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "filters": 128, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_13", "dtype": "float32", "trainable": true, "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4", "data_format": "channels_last", "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "dtype": "float32", "units": 250, "name": "dense_8", "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "use_bias": true, "dtype": "float32", "units": 11, "name": "dense_9", "bias_regularizer": null, "activity_regularizer": null, "activation": "softmax", "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "trainable": true}}]}}, "backend": "tensorflow", "training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0, "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421, "name": "Adam", "learning_rate": 0.0010000000474974513, "epsilon": 1e-07, "amsgrad": false}}}}, "format": "layers-model", "convertedBy": "TensorFlow.js Converter v3.1.0"}