{"format": "layers-model", "convertedBy": "TensorFlow.js Converter v3.1.0", "modelTopology": {"backend": "tensorflow", "model_config": {"config": {"name": "sequential", "layers": [{"config": {"dtype": "float32", "name": "conv2d_input", "batch_input_shape": [null, 100, 200, 3], "sparse": false, "ragged": false}, "class_name": "InputLayer"}, {"config": {"dtype": "float32", "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "name": "conv2d", "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "groups": 1, "filters": 32, "batch_input_shape": [null, 100, 200, 3], "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "name": "conv2d_1", "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "groups": 1, "filters": 64, "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "activation": "relu", "name": "conv2d_2", "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "groups": 1, "filters": 128, "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten", "dtype": "float32", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"dtype": "float32", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "relu", "name": "dense", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 250, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}, {"config": {"dtype": "float32", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "softmax", "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 11, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}]}, "class_name": "Sequential"}, "keras_version": "2.4.0", "training_config": {"loss_weights": null, "weighted_metrics": null, "metrics": ["accuracy"], "loss": "categorical_crossentropy", "optimizer_config": {"config": {"beta_1": 0.8999999761581421, "learning_rate": 0.0010000000474974513, "decay": 0.0, "name": "Adam", "beta_2": 0.9990000128746033, "amsgrad": false, "epsilon": 1e-07}, "class_name": "Adam"}}}, "generatedBy": "keras v2.4.0", "weightsManifest": [{"paths": ["group1-shard1of8.bin", "group1-shard2of8.bin", "group1-shard3of8.bin", "group1-shard4of8.bin", "group1-shard5of8.bin", "group1-shard6of8.bin", "group1-shard7of8.bin", "group1-shard8of8.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [128], "dtype": "float32"}, {"name": "dense/kernel", "shape": [29440, 250], "dtype": "float32"}, {"name": "dense/bias", "shape": [250], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [250, 11], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [11], "dtype": "float32"}]}]}