{"format": "layers-model", "weightsManifest": [{"weights": [{"name": "conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [128], "dtype": "float32"}, {"name": "dense/kernel", "shape": [29440, 250], "dtype": "float32"}, {"name": "dense/bias", "shape": [250], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [250, 11], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [11], "dtype": "float32"}], "paths": ["group1-shard1of8.bin", "group1-shard2of8.bin", "group1-shard3of8.bin", "group1-shard4of8.bin", "group1-shard5of8.bin", "group1-shard6of8.bin", "group1-shard7of8.bin", "group1-shard8of8.bin"]}], "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.1.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "training_config": {"weighted_metrics": null, "loss_weights": null, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "optimizer_config": {"config": {"name": "Adam", "epsilon": 1e-07, "learning_rate": 0.0010000000474974513, "amsgrad": false, "beta_1": 0.8999999761581421, "decay": 0.0, "beta_2": 0.9990000128746033}, "class_name": "Adam"}}, "model_config": {"config": {"layers": [{"config": {"batch_input_shape": [null, 100, 200, 3], "sparse": false, "ragged": false, "dtype": "float32", "name": "conv2d_input"}, "class_name": "InputLayer"}, {"config": {"batch_input_shape": [null, 100, 200, 3], "name": "conv2d", "use_bias": true, "activation": "relu", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "padding": "valid", "trainable": true, "groups": 1, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 32, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d", "dtype": "float32", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "name": "conv2d_1", "use_bias": true, "activation": "relu", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "padding": "valid", "trainable": true, "groups": 1, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 64, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "dtype": "float32", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dilation_rate": [1, 1], "name": "conv2d_2", "use_bias": true, "activation": "relu", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "padding": "valid", "trainable": true, "groups": 1, "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 128, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "dtype": "float32", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten", "data_format": "channels_last", "dtype": "float32", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "name": "dense", "use_bias": true, "activation": "relu", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "units": 250, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "name": "dense_1", "use_bias": true, "activation": "softmax", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "units": 11, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "class_name": "Dense"}], "name": "sequential"}, "class_name": "Sequential"}}}