{"weightsManifest": [{"paths": ["group1-shard1of9.bin", "group1-shard2of9.bin", "group1-shard3of9.bin", "group1-shard4of9.bin", "group1-shard5of9.bin", "group1-shard6of9.bin", "group1-shard7of9.bin", "group1-shard8of9.bin", "group1-shard9of9.bin"], "weights": [{"name": "conv2d/kernel", "dtype": "float32", "shape": [3, 3, 3, 32]}, {"name": "conv2d/bias", "dtype": "float32", "shape": [32]}, {"name": "conv2d_1/kernel", "dtype": "float32", "shape": [3, 3, 32, 64]}, {"name": "conv2d_1/bias", "dtype": "float32", "shape": [64]}, {"name": "conv2d_2/kernel", "dtype": "float32", "shape": [3, 3, 64, 128]}, {"name": "conv2d_2/bias", "dtype": "float32", "shape": [128]}, {"name": "dense/kernel", "dtype": "float32", "shape": [36992, 250]}, {"name": "dense/bias", "dtype": "float32", "shape": [250]}, {"name": "dense_1/kernel", "dtype": "float32", "shape": [250, 11]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [11]}]}], "convertedBy": "TensorFlow.js Converter v3.1.0", "generatedBy": "keras v2.4.0", "format": "layers-model", "modelTopology": {"training_config": {"metrics": ["accuracy"], "weighted_metrics": null, "loss": "categorical_crossentropy", "optimizer_config": {"config": {"name": "Adam", "beta_2": 0.9990000128746033, "learning_rate": 0.0010000000474974513, "beta_1": 0.8999999761581421, "epsilon": 1e-07, "decay": 0.0, "amsgrad": false}, "class_name": "Adam"}, "loss_weights": null}, "keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"config": {"name": "sequential", "layers": [{"config": {"dtype": "float32", "ragged": false, "batch_input_shape": [null, 150, 150, 3], "sparse": false, "name": "conv2d_input"}, "class_name": "InputLayer"}, {"config": {"dtype": "float32", "name": "conv2d", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "groups": 1, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "trainable": true, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "filters": 32, "batch_input_shape": [null, 150, 150, 3], "kernel_constraint": null, "kernel_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d", "trainable": true, "strides": [2, 2], "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "name": "conv2d_1", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "groups": 1, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "trainable": true, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "kernel_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "name": "conv2d_2", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "relu", "kernel_size": [3, 3], "groups": 1, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "data_format": "channels_last", "trainable": true, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "kernel_regularizer": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "dtype": "float32", "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"dtype": "float32", "units": 250, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"dtype": "float32", "units": 11, "bias_constraint": null, "activity_regularizer": null, "activation": "softmax", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_1", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}}}